test/fixtures/control_success/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoPhase
{
    transportModel  twoPhase;
    phase1          water;
    phase2          air;
}


phase1
{
    transportModel  Newtonian;

    nu              nu [0 2 -1 0 0 0 0] 0.000001; // New variable
    rho             rho [ 1 -3 0 0 0 0 0 ] 998.23; //New variable

    CrossPowerLawCoeffs
    {
        m               m [0 0 1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nu0 [0 2 -1 0 0 0 0] 1.0;  // New Varibale
        nuInf           nuInf [0 2 -1 0 0 0 0] 1.0;  // New Varibale
    }

    BirdCarreauCoeffs
   {
        k               k [0 0 1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nu0 [0 2 -1 0 0 0 0] 1.0;   // New Varibale
        nuInf           nuInf [0 2 -1 0 0 0 0] 1.0;   // New Varibale
   }

   powerLawCoeffs
   {
        k               k [0 2 -1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nuMin       nuMin [0 2 -1 0 0 0 0] 1.0;  // New Varibale
        nuMax       nuMax [0 2 -1 0 0 0 0] 1.0;  // New Varibale

   }

   HerschelBulkleyCoeffs
   {
        k               k [0 2 -1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nuMin [0 2 -1 0 0 0 0] 1.0;   // New Varibale
        tau0            tau0 [0 2 -2 0 0 0 0] 1.0;    
   }

}

phase2
{
    transportModel  Newtonian;

    nu              nu [0 2 -1 0 0 0 0] 1.58946099535e-05; 
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.1614; 

    CrossPowerLawCoeffs
    {
        m               m [0 0 1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nu0 [0 2 -1 0 0 0 0] 1.0;  
        nuInf           nuInf [0 2 -1 0 0 0 0] 1.0;  
    }

    BirdCarreauCoeffs
   {
        k               k [0 0 1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nu0 [0 2 -1 0 0 0 0] 1.0;   
        nuInf           nuInf [0 2 -1 0 0 0 0] 1.0;   
   }

   powerLawCoeffs
   {
        k               k [0 2 -1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nuMin       nuMin [0 2 -1 0 0 0 0] 1.0;  
        nuMax       nuMax [0 2 -1 0 0 0 0] 1.0;  

   }

   HerschelBulkleyCoeffs
   {
        k               k [0 2 -1 0 0 0 0] 1.0;
        n               n [0 0 0 0 0 0 0] 1.0;
        nu0             nuMin [0 2 -1 0 0 0 0] 1.0;   
        tau0            tau0 [0 2 -2 0 0 0 0] 1.0;    
   }

}


sigma  sigma [ 1 0 -2 0 0 0 0 ] 0.1 ; // Surface tension coeff


// ************************************************************************* //
