test/fixtures/control_success/0_orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.OpenFOAM.org                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "inlet1_.*"
    {
        type            zeroGradient;
    }
    "inlet2_.*"
    {
        type            zeroGradient;
    }
    "outlet1_.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    "walls_.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
