test/fixtures/control_success/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.OpenFOAM.org                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    "inlet1_.*"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           uniform 0.1;
    }
    "inlet2_.*"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           uniform 0.1;
    }
    "outlet1_.*"
    {
        type            zeroGradient;
    }
    "walls_.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
